{
    "x-offset": 8,
    "states": [
        {
            "id": "dystopia_gender",
            "msg": "This one is a good thing, so we will not send our army of health goth pigeons after you. Welcome to the party. To call into the upcoming public comment session, press 1. To organize a protest march, press 2. To go outside of state power, press 3.",
            "transitions": [
                "gender_comment",
                "gender_protest",
                "gender_anarchy_0"
            ],
            "x": 0,
            "y": 1
        }, {
            "id": "gender_comment",
            "msg": "Welcome to the public comment meeting. Press 1 to raise your hand.",
            "transitions": [
                "gender_comment_2"
            ],
            "x": -2,
            "y": 2
        }, {
            "id": "gender_comment_2",
            "msg": "Public comment will start at 16AM and go on until dawn. You have pi+i minutes to comment. For rational talking points, press 1. For real talking points, press 2.",
            "transitions": [
                "gender_comment_rational_0",
                "gender_comment_real_0"
            ],
            "x": -2,
            "y": 3
        }, {
            "id": "gender_comment_rational",
            "sequence": [
                "Years of effort to reform gender have failed. \n\n Strict adherence to binary gender is no longer serving our communities. \n\n Our time, glitter, and hormones are better spent on literally anything else.",
                "These are the FACTS that you will tell your elected official when, after many years of trying, they finally win at Candy Crush. Convinced by the magic of victory, they might believe you."
            ],
            "next": "gender_comment_end",
            "x": -3,
            "y": 4
        }, {
            "id": "gender_comment_real",
            "sequence": [
                "Your supervisor may not be aware that essentialism is sooo second wave. \n\n Gender isn’t vapor at all. \n\n Our actions determine our morals. If our elected officials do not act on your behalf, they will drown in the waves of the future. Most importantly, their careers shall absolutely NOT be mourned.",
                "These are the feelings that you will tell your elected official. They are now aware of your feelings about their carreer. This will influence their vote."
            ],
            "next": "gender_comment_end",
            "x": -2,
            "y": 4
        }, {
            "id": "gender_comment_end",
            "msg": "Thank you for your participation in the politican process. To try another line of argument, press 1. To find another means of defunding gender, press 2. To go to a different dystopia, press 3.",
            "transitions": [
                "gender_comment_2",
                "dystopia_gender",
                "dystopia_start"
            ],
            "end": true,
            "x": -2,
            "y": 8
        }, {
            "id": "gender_protest",
            "msg": "Activism is a team sport. We must all work together. Press 1 to continue.",
            "transitions": ["gender_protest_1"],
            "x": 0,
            "y": 2
        }, {
            "id": "gender_protest_1",
            "msg": "If there are other groups of players nearby, I want you to ask them some questions. Don’t worry, I’ll wait. If nobody else is nearby, just tell me your answers instead. How has your relationship with your gender changed over the years?",
            "speech": "gender_protest_2",
            "x": 0,
            "y": 3
        }, {
            "id": "gender_protest_2",
            "msg": "Look at the people that surround you, physically or emotionally. How much of your relationships are influenced by your respective genders, chosen or assigned? Tell your answers to me, or each other. I will wait.",
            "speech": "gender_protest_3",
            "x": 0,
            "y": 4
        }, {
            "id": "gender_protest_3",
            "msg": "Collective action is a convention for fans  of a better world. We will win. What will we replace gender with, if anything? How can we support change here and now? Discuss with each other. I will wait.",
            "speech": "gender_protest_4",
            "x": 0,
            "y": 5
        }, {
            "id": "gender_protest_4",
            "msg": "Make up some chants for your protest. Make them short. Make them rhyme. Shout them. Be bold. Take this time to send them to your people or group chat. You are not alone.",
            "speech": "gender_protest_5",
            "x": 0,
            "y": 6
        }, {
            "id": "gender_protest_5",
            "url": "https://web.mit.edu/ekate/Public/lorde.mp3",
            "x": 0,
            "y": 7
        }, {
            "id": "gender_anarchy",
            "sequence": [
                "Most people imagine gender as a binary. Male at one end, female on the other end. Nonbinary people somewhere in the middle. It confuses me how easily humans can fall into binary, polarizing, black and white thinking? \n\n What if we thought about gender as a cartesian coordinate system? A constellation? A galaxy?",
                "What if gender was like being a raver, or a goth? You’d be expected to change and choose different flavors throughout your life. More self-expression, less oppression."
            ],
            "next": "gender_anarchy_choice",
            "x": 1,
            "y": 2
        }, {
            "id": "gender_anarchy_choice",
            "msg": "If you had to choose an alternate gender, what would it be? Press 1 for witch house. Press 2 for cloud rap. Press 3 for seapunk.",
            "transitions": [
                "witchhouse",
                "cloudrap",
                "seapunk"
            ],
            "x": 1,
            "y": 5
        }, {
            "id": "witchhouse",
            "audio":"https://web.mit.edu/ekate/Public/witchouse.mp3",
            "next":"gender_anarchy_end",
            "x":0,
            "y":6
        }, {
            "id": "cloudrap",
            "audio":"https://web.mit.edu/ekate/Public/cloudrap.mp3",
            "next":"gender_anarchy_end",
            "x":1,
            "y":6
        }, {
            "id": "seapunk",
            "audio":"https://web.mit.edu/ekate/Public/seapunk.mp3",
            "next":"gender_anarchy_end",
            "x":2,
            "y":6
        }, {
            "id": "gender_anarchy_end",
            "msg": "To find another means of defunding gender, press 1. To go to a different dystopia, press 2.",
            "transitions": [
                "dystopia_gender",
                "dystopia_start"
            ],
            "end": true,
            "x": 2,
            "y": 7
        }
    ]
}
